export const TEST_CONTEXT = {
    // TimeZoneはJSTとする
    time_zone: 'Asia/Tokyo',
    // 2020-12-01T12:34:56.123+09:00を今日の日付とする
    epoch_time_milliseconds: 1606793696123,
};

export interface TestParameter {
    text: string;
    expects: string;
}

export const DATA_TEST_TEXT_LIST: TestParameter[] = [
    {
        text: '今日',
        expects: '2020-12-01T00:00:00+09:00',
    },
    {
        text: '現在',
        expects: '2020-12-01T12:34:56+09:00',
    },
    {
        text: '今日の４日前',
        expects: '2020-11-27T00:00:00+09:00',
    },
    {
        text: '４日前',
        expects: '2020-11-27T12:34:56+09:00',
    },
    {
        text: '明日',
        expects: '2020-12-02T00:00:00+09:00',
    },
    {
        text: '明日の３時',
        expects: '2020-12-02T03:00:00+09:00',
    },
    {
        text: '昨日',
        expects: '2020-11-30T00:00:00+09:00',
    },
    {
        text: '昨日の１４時',
        expects: '2020-11-30T14:00:00+09:00',
    },
    {
        text: '金曜日',
        expects: '2020-12-04T00:00:00+09:00',
    },
    {
        text: '次の金曜日',
        expects: '2020-12-04T00:00:00+09:00',
    },
    {
        text: '第三火曜',
        expects: '2020-12-15T00:00:00+09:00',
    },
    {
        text: '前の第三火曜',
        expects: '2020-11-17T00:00:00+09:00',
    },
    {
        text: '次の第一水曜',
        expects: '2020-12-02T00:00:00+09:00',
    },
    {
        text: '次の第一金曜',
        expects: '2020-12-04T00:00:00+09:00',
    },
    {
        text: '来月の月末',
        expects: '2021-01-31T00:00:00+09:00',
    },
    {
        text: '来年の年末',
        expects: '2021-12-31T00:00:00+09:00',
    },
    {
        text: 'あさっての12時',
        expects: '2020-12-03T12:00:00+09:00',
    },
    {
        text: 'しあさって',
        expects: '2020-12-04T00:00:00+09:00',
    },
    {
        text: 'やのあさっての午後8時',
        expects: '2020-12-05T20:00:00+09:00',
    },
    {
        text: '三か月前の１５日',
        expects: '2020-09-15T00:00:00+09:00',
    },
    {
        text: '来年の３月２２日',
        expects: '2021-03-22T00:00:00+09:00',
    },
    {
        text: '２０１９年の年末',
        expects: '2019-12-31T00:00:00+09:00',
    },
    {
        text: '明後日の１７時と３０分',
        expects: '2020-12-03T17:30:00+09:00',
    },
    {
        text: '1606136040の一か月前',
        expects: '2020-10-23T21:54:00+09:00',
    },
    {
        text: '20201011の月末',
        expects: '2020-10-31T00:00:00+09:00',
    },
    {
        text: '2020/10/11の月末',
        expects: '2020-10-31T00:00:00+09:00',
    },
    {
        text: '2020/10/11 20:20:13の三時間前',
        expects: '2020-10-11T17:20:13+09:00',
    },
    {
        text: '昨日の四日前の三日前の八時',
        expects: '2020-11-23T08:00:00+09:00',
    },
    {
        text: '先月の月末',
        expects: '2020-11-30T00:00:00+09:00',
    },
    {
        text: '今月の月末',
        expects: '2020-12-31T00:00:00+09:00',
    },
    {
        text: '来月の月末',
        expects: '2021-01-31T00:00:00+09:00',
    },
    {
        text:
            '花巻市ふるさと納税　ワンストップ特例申請に関する申請期限（令和３年１月１２日）などを掲載したＱ＆Ａを市ホームページに掲載しました。',
        expects: '2021-01-12T00:00:00+09:00',
    },
    {
        text:
            'NHK BSプレミアムは、2011年4月から日本放送協会が放送している衛星基幹放送のテレビジョン放送で国内放送でもある。',
        expects: '2011-04-01T00:00:00+09:00',
    },
    {
        text: '【放送日時】 [BSプレミアム] 12月29日 午後10時30分',
        expects: '2020-12-29T22:30:00+09:00',
    },
    {
        text: '5/26の16:00以前にゲームを始めた方',
        expects: '2020-05-26T16:00:00+09:00',
    },
];

export const FROMAT_TEST_TEXT_LIST: TestParameter[] = [
    { text: 'スラッシュ区切りの年月日時分秒', expects: '2020/12/01 12:34:56' },
    { text: 'スラッシュ区切りの年月日', expects: '2020/12/01' },
    { text: 'スラッシュ区切りの年月', expects: '2020/12' },
    { text: 'ISO8601', expects: '2020-12-01T12:34:56+09:00' },
    { text: 'ISO', expects: '2020-12-01T12:34:56+09:00' },
    { text: 'アイエスオー', expects: '2020-12-01T12:34:56+09:00' },
    { text: 'アイエヌオー', expects: '2020-12-01T12:34:56+09:00' },
    { text: 'たぶんアイエヌオー', expects: '2020-12-01T12:34:56+09:00' },
    { text: 'IGO8688', expects: '2020-12-01T12:34:56+09:00' },
    { text: '日本語の年月日時分秒', expects: '2020年12月01日 12時34分56秒' },
    { text: '漢字の年月日時分秒', expects: '2020年12月01日 12時34分56秒' },
    { text: '区切りなしの年月日時分秒', expects: '20201201123456' },
    { text: '区切りなしの年月日', expects: '20201201' },
    { text: '区切りなしの時分秒', expects: '123456' },
    { text: 'ハイフン区切りの年月日時分秒', expects: '2020-12-01 12:34:56' },
    { text: 'スラッシュ区切りの年月日時分秒', expects: '2020/12/01 12:34:56' },
    { text: 'コロン区切りの時分秒', expects: '12:34:56' },
    { text: 'コロン区切りの時分', expects: '12:34' },
    { text: '和暦の年月日', expects: '令和2年12月01日' },
    { text: '年', expects: '2020年' },
    { text: '月', expects: '12月' },
    { text: '日', expects: '1日' },
    { text: '時', expects: '12時' },
    { text: '分', expects: '34分' },
    { text: '秒', expects: '56秒' },
    { text: 'ミリ秒', expects: '123ミリ秒' },
    { text: '曜日', expects: '火曜日' },
];
